# -*- coding: utf-8 -*-
# @Time    : 20/03/12 21:00
# @Author  : Wang Yu
# @Project : 07 My_NLP
# @File    : test_foolnltk.py
# @Software: PyCharm


import fool

# with open(r"C:\Users\NiceToMeeetU\iCloudDrive\01 Mine\03 飞雪连天射白鹿\新修版\倚天屠龙记（世纪新修版）.txt",'r') as f:
#     text = f.read()


text = """原来范遥护送赵敏去和张无忌相会，心中只挂念夺取解药之事。赵敏命他在小酒家的外堂中相候，他立即出店，飞奔回到万安寺，进了高塔，径到第十层乌旺阿普房外。
　　乌旺阿普正站在门外，见了他便恭恭敬敬地叫声：“苦大师。”
　　范遥点了点头，心中暗笑：“好啊，鹿老儿为师不尊，自己躲在房中，和王爷的爱姬风流快活，却叫徒儿在门外把风。乘着这老儿正在胡天胡地之时，掩将进去，正好夺了他的解药。”于是佝偻着身子，从乌旺阿普身旁走过，突然反手一指，点中了他小腹上的穴道。别说乌旺阿普毫没提防，即令全神戒备，也躲不过这一指。他要穴一经点中，立时呆呆地不能动弹，心下大为奇怪，不知什么地方得罪了这位哑巴头陀，难道刚才这一声“苦大师”叫得不够恭敬么？
　　范遥推开房门，快如闪电地扑向床上，双脚尚未落地，一掌已击向床上之人。他深知鹿杖客武功了得，这一掌若不能将他击得重伤，那便是一场不易分得胜败的生死搏斗，是以这一掌使上了十成劲力。只听得啪的一声响，只击得被子破裂、棉絮纷飞，揭开棉被看时，只见韩姬口鼻流血，已给他打得香殒玉碎，却不见鹿杖客的影子。
　　范遥心念一动，回身出房，将乌旺阿普拉了进来，随手又加一指，将他塞入床底。刚掩上门，只听得鹿杖客在门外怒叫：“阿普，阿普，你怎敢擅自走开？”
　　原来鹿杖客不耐烦灭绝师太母女二人婆婆妈妈地不知说到几时方罢，便即回到乌旺阿普房来，却见这一向听话的大弟子居然没在房外守卫，好生恼怒，推开房门，幸好并无异状，韩姬仍是面向里床，身上盖着棉被。
　　鹿杖客拿起门闩，先将门上了闩，转身笑道：“美人儿，我来给你解开穴道，可是你不许出声说话。”一面说，一面便伸手到被窝中去，手指刚碰到韩姬的脊背，突然间手腕上一紧，五根铁钳般的手指已将他脉门牢牢扣住。这一下全身劲力登失，半点力道也使不出来，只见棉被掀开，一个长发头陀钻了出来，正是苦头陀。
　　范遥右手扣住鹿杖客的脉门，左手运指如风，连点了他周身一十九处大穴。鹿杖客登时软瘫在地，再也动弹不得，眼光中满是范遥指着他说道：“老夫行不改姓，坐不改名，明教光明右使，姓范名遥的便是。今日你遭我暗算，枉你自负机智绝伦，其实是昏庸无用之极。此刻我若杀了你，非英雄好汉之所为，且留下你一条性命，你若有种，日后只管来找我范遥报仇。”
　　他兴犹未足，脱去鹿杖客全身衣服，将他剥得赤条条的，和韩姬的尸身并头而卧，再拉过棉被，盖在这一死一活的二人身上。这才取过鹿角杖，旋开鹿角，尽数倒出解药，然后逐一到各间囚室之中，分给空闻大师、宋远桥、俞莲舟等各人服下。待得一个个送毕解药，耗时已然不少，中间不免费些唇舌，解说几句。最后来到灭绝师太室中，见她不信此是解药，索性吓她一吓，说是毒药。范遥恨她伤残本教众多兄弟，得能阴损她几句，甚觉快意。
　　他分送解药已毕，正自得意，忽听得塔下人声喧哗，其中鹤笔翁的声音最是响亮：“这苦头陀是奸细，快拿他下来！”范遥暗暗叫苦：“糟了，糟了，是谁去救了这家伙出来？”探头向塔下望去，只见鹤笔翁率领了大批武士，已将高塔团团围住。苦头陀这一探头，孙三毁和李四摧双箭齐发，大骂：“恶贼头陀，害得人好惨！”
　　鹤笔翁等三人穴道遭点，本非一时所能脱困，他三人藏在鹿杖客房中，旁人也不敢贸然进去。岂知汝阳王府中派出来的众武士在万安寺中到处搜查，不见王爷爱姬的影踪，便有人想起了鹿杖客生平好色贪花的性子。可是众武士对他向来忌惮，虽疑心王爷爱姬失踪和他有关，却有谁敢去太岁头上动土？挨了良久，率领众武士的哈总管心生一计，命一名小兵去敲鹿杖客的房门，鹿杖客身份极高，就算动怒，谅来也不能对这无名小卒怎么样，即使真的杀了这小兵，那也无足轻重。这小兵打了数下门，房中无人答应。
　　哈总管一咬牙，命小兵只管推门进去瞧瞧。这一瞧，便瞧见鹤笔翁和孙三毁、李四摧倒在地下。其时鹤笔翁运气冲穴，已冲开了三四成，哈总管给他解穴，登时便行动自如。鹤笔翁怒气冲天，查问鹿杖客和苦头陀的去向，得知已到了高塔之中，便解开孙三毁和李四摧穴道，率领众武士围住高塔，大声呼喊，叫苦头陀下来决一死战。
　　范遥暗惊：“决一死战便决一死战，姓范的还怕了你不成？只不过那些臭和尚、老尼姑服解药未久，一时三刻之间功力不能恢复。这鹤笔翁已听到我和鹿杖客的说话，就算我将鹿老儿杀了，也已不能灭口，这便如何是好？”一时彷徨无计，只听得鹤笔翁叫道：“死头陀，你不下来，我便上来了！”
　　范遥返身将鹿杖客和韩姬一起裹在被窝之中，回到塔边，将两人高高举起，叫道：“鹤老儿，你只要走近塔门一步，我便将这头淫鹿摔下来了。”
　　众武士手中高举火把，照耀得四下里白昼相似，只是那宝塔太高，火光照不上去，但影影绰绰，仍可看到鹿杖客和韩姬的面貌。
　　鹤笔翁大惊，叫道：“师哥，师哥，你没事么？”连叫数声，不听得鹿杖客答话，只道已给苦头陀弄死，心下气苦，叫道：“贼头陀，你害死我师哥，我跟你势不两立。”
　　范遥解开了鹿杖客的哑穴。鹿杖客立时破口大骂：“贼头陀，你这里应外合的奸细，千刀万剐地杀了你……”范遥容他骂得几句，又点上了他哑穴。鹤笔翁见师兄未死，心下稍安，只怕苦头陀真的将师兄摔了下来，不敢走近塔门。
　　这般僵持良久，鹤笔翁始终不敢上来相救师兄。范遥只盼尽量拖延时光，多拖得一刻便好一刻，他站在栏杆之旁，哈哈大笑，叫道：“鹤老儿，你师兄色胆包天，竟将王爷的爱姬偷盗出来。是我捉奸捉双，将他二人当场擒获。你还想包庇师兄么？总管大人，快快将这老儿拿下了。他师兄弟二人叛逆作乱，罪不容诛。你拿下了他，王爷定然重重有赏。”
　　哈总管斜目睨视鹤笔翁，要想动手，却又不敢。他见苦头陀突然开口说话，虽觉奇怪，但清清楚楚地瞧见鹿杖客和韩姬裹在一条棉被之中，何况心中先人为主，早已信了九成。他高声叫道：“苦大师，请你下来，咱们同到王爷跟前分辨是非。你们三位都是前辈高人，小人谁也不敢冒犯。”
　　范遥一身是胆，心想同到王府之中去见王爷，待得分清是非黑白，塔上诸侠体内毒性已解，当即叫道：“妙极，妙极！我正要向王爷领赏。总管大人，你看住这个鹤老儿，千万别让他乘机逃了。”
　　正在此时，忽听得马蹄声响，一乘马急奔迸寺，直冲到高塔之前，众武士一齐躬身行礼，叫道：“小王爷！”范遥从塔上望将下来，见此人头上束发金冠闪闪生光，跨着一匹高大白马，身穿锦袍，正是汝阳王的世子库库特穆尔、汉名王保保的便是。
　　王保保厉声问道：“韩姬呢？父王大发雷霆，要我亲来查看。”哈总管上前禀告，便说是鹿杖客将韩姬盗了来，现为苦头陀拿住。鹤笔翁急道：“小王爷，莫听他胡说八道。这头陀乃是奸细，他陷害我师哥……”王保保双眉一轩，叫道：“一起下来说话！”
　　范遥在王府日久，心知王保保精明能干，不在乃父之下，自己的诡计瞒得过旁人，须瞒不过他，一下高塔，只怕小王爷三言两语之际便识穿破绽，下令众武士围攻，单是个鹤笔翁便不好斗，自己脱身或不为难，塔中诸侠就救不出来了，高声道：“小王爷，我拿住了鹿杖客，他师弟恨我入骨，我只要一下来，他立刻便会杀了我。”
　　王保保道：“你快下来，鹤先生杀不了你。”范遥摇摇头，朗声道：“我还是在塔上平安些。小王爷，我苦头陀一生不说话，今日事出无奈，被迫开口，那全是我报答王爷的一片赤胆忠心。你若不信，我苦头陀只好跳下高塔，一头撞死给你看了。”
　　王保保听他言语不尽不实，多半是胡说八道，有意拖延，低声问哈总管道：“他有何图谋，要故意延搁，是在等候什么人到来么？”哈总管道：“小人不知……”鹤笔翁抢着道：“小王爷，这贼头陀抢了我师哥的解药，要解救高塔中囚禁着的一众叛逆。”王保保登时省悟，叫道：“苦大师，我明白你的功劳，你快下来，我重重有赏。”
　　范遥道：“我给鹿杖客踢了两脚，腿骨都快断了，这会儿全然动弹不得。小王爷，请你稍待片刻，我运气疗伤，当即下来。”王保保喝道：“哈总管，你快派人上去，背负苦大师下塔。”范遥大叫：“使不得，使不得，谁一移动我身子，我两条腿就废了。”
　　王保保此时更无怀疑，眼见韩姬和鹿杖客双双裹在一条棉被之中，就算两人并无苟且，父王也不能再要这姬人，低声道：“哈总管，举火烧了宝塔。派人用强弓射住，不论是谁从塔上跳下，一概射杀。”哈总管答应了，传下令去，登时弓箭手弯弓搭箭，团团围住高塔，有些武士便去取火种柴草。
　　鹤笔翁大惊，叫道：“小王爷，我师哥在上面啊。”王保保冷冷地道：“这头陀不能在上面等一辈子，塔下一举火，他自会下来。”鹤笔翁叫道：“他若将我师哥摔将下来，那可怎么办？小王爷，这火不能放。”王保保哼了一声，不去理他。
　　片刻之间，众武士已取过柴草火种，在塔下点起火来。
　　鹤笔翁是武林中大有身份之人，受汝阳王礼聘入府，向来甚受敬重，不料今日连中苦头陀的奸计不算，连小王爷也不以礼相待，眼见师兄危在顷刻，这时也不理他什么小王爷大王爷，提起鹤嘴双笔，纵身而上，挑向两名正在点火的武士，机卩八两响，两名武士远远摔开。
　　王保保大怒，喝道：“鹤先生，你也要犯上作乱么？”鹤笔翁道：“你别叫人放火，我自不会来阻挡。”王保保喝道：“点火！”左手一挥，他身后蹿出五名红衣番僧，从众武士手中接过火把，向塔下的柴草掷了过去。柴草一遇火焰，登时便燃起熊熊烈火。鹤笔翁大急，从一名武士手中抢过一根长矛，扑打着火的柴草。
　　王保保喝道：“拿下了！”那五名红衣番僧各持戒刀，登时将鹤笔翁围住。
　　鹤笔翁怒极，抛下长矛，伸手便来拿左首一名番僧手中的兵刃。这番僧并非庸手，戒刀翻转，反剁他肩头。鹤笔翁待得避开，身后金刃劈风，又有两柄戒刀同时砍到。
　　王保保手下共有十八名武功了得的番僧，号称“十八金刚”，分为五刀、五剑、四杖、四钹。这五僧乃“五刀金刚”，单打独斗跟鹤笔翁的武功都差得远了，但五刀金刚联手，攻守相助，鹤笔翁武功虽高，但早一日给张无忌击得受伤呕血，内力大损，何况眼见火势上腾，师兄处境极为危险，不免沉不住气，一时难以取胜。
　　王保保手下众武士加柴点火，火头烧得更加旺了。这宝塔有砖有木，在这大火焚烧之下，底下数层便毕毕剥剥地烧了起来。
　　范遥抛下鹿杖客，冲到囚禁武当诸侠的室中，叫道：“鞑子在烧塔了，各位内力是否已复？”只见宋远桥、俞莲舟等人各自盘坐用功，凝神专志，谁也没答话，显然到了回复功力的紧要关头。看守诸侠的武士有几名抢来干预，都让范遥抓将起来，一个个掷出塔外，活活摔死。其余的冒火突烟，逃了下去。
　　过不多时，火焰已烧到了第四层，囚禁在这层中的华山派诸人不及等功力恢复，狼狈万状地逃上第五层。火焰毫不停留地上腾，跟着第五层中的崆峒派诸人也逃了上去。有的奔走稍慢，连衣服须发都烧着了。
　　范遥正束手无策，忽听得一人叫道：“范右使，接住了！”正是韦一笑的声音。范遥大喜，往声音来处瞧去，只见韦一笑站在万安寺后殿的殿顶，抖手将一条长绳抛了过来，范遥伸手接住。韦一笑叫道：“你缚在栏杆上，便是一道绳桥。”范遥刚缚好绳子，神箭八雄中的赵一伤嗖的一箭，便将绳子从中射断。范遥和韦一笑同声破口大骂。
　　韦一笑骂道：“射你个奶奶。哪一个不抛下弓箭，老子先宰了他。”一面骂，一面抽出长剑，纵身下地。他双足刚着地，五名青袍番僧立时仗剑围上，却是王保保手下十八番僧中的“五剑金刚”，五人手中长剑闪烁，剑招诡异，和韦一笑斗在一起。
　　鹤笔翁挥动鹤嘴笔苦战，高声叫道：“小王爷，你再不下令救火，我可要对你不客气了。”王保保哪去理他。四名手执禅杖的番僧分立小王爷四周，以防有人偷袭。鹤笔翁焦躁起来，双笔突使一招“横扫千军”，将身前三名番僧逼开两步，提气急奔，冲到了塔旁。五名番僧随后追到。鹤笔翁双足一登，上了宝塔第一层的屋檐。五名番僧见火势烧得正旺，便不追上。
　　鹤笔翁一层层地上跃，待得登上第四层屋檐时，范遥从第七层上探头出来，高举鹿杖客的身子，大声叫道：“鹤老儿，快给我停步！你再动一步，我便将鹿老儿摔成鹿肉浆。”鹤笔翁果然不敢再动，叫道：“苦大师，我师兄弟跟你往日无怨，近日无仇，你何苦如此跟我们为难？你要救你的老情人灭绝师太，要救你女儿周姑娘，尽管去救便是，我决不来阻拦。”
　　灭绝师太服了苦头陀给她的解药后，只道真是毒药，自己必死，只是周芷若竟也给灌了毒药，毕生指望尽化泡影，心中如何不苦？正自伤心，忽听得塔下喧哗之声大作，跟着苦头陀和鹤笔翁斗口、王保保下令纵火等情形，一一听得清楚。她心下奇怪：“莫非这鬼模样的头陀当真是救我来着？”试一运气，立时便觉丹田中一股暖意升将上来，和自中毒以来的情形大不相同。
　　她不肯听赵敏之令出去殿上比武，已自行绝食了六七日，胃中早已空空如也，解药人肚，迅速化入血液，药力行开，比谁都快。加之她内力深厚，犹在宋远桥、俞莲舟、何太冲诸人之上，仅比少林派掌门空闻方丈稍逊，十香软筋散的毒性遇到解药后渐渐消退，她一经运气，内力登时生出，不到半个时辰，内功已复了五六成。她正加紧运功，忽听得鹤笔翁在外高声大叫，字字如利箭般钻入耳中：“……你要救你的老情人灭绝师太，要救你女儿周姑娘，尽管去救便是，我决不来阻拦。”
　　这什么“老情人”云云，叫她听了如何不怒？大踏步走到栏杆之旁，怒声喝道：“你满嘴胡说八道，不清不白地说些什么？”鹤笔翁求道：“老师太，你快劝劝你老……老朋友，先放我师兄下来。我担保你一家三口，平安离开。玄冥二老说一是一，说二是二，决不致言而无信。”灭绝师太怒道：“什么一家三口？”
　　范遥虽身处危境，还是呵呵大笑，甚是得意，说道：“老师太，这老儿说我是你的旧情人，那个周姑娘嘛，是我和你两个的私生女儿。”
　　灭绝师太怒容满面，在时明时暗的火光照耀之下，看来极是可怖，沉声喝道：“鹤老儿，你上来，我跟你拼上一百掌再说。”若在平时，鹤笔翁说上来便上来，何惧于一个峨嵋掌门，但此刻师兄落在别人手中，不敢蛮来，叫道：“苦头陀，那是你自己说的，可不是我信口开河。”灭绝师太双目瞪着范遥，厉声问道：“这是你说的么？”
　　范遥哈哈一笑，正要乘机挖苦她几句，忽听得塔下喊声大作，往下望时，只见火光中一条人影如穿花蝴蝶般迅速飞舞，在人丛中穿插来去，呛啷啷、呛啷啷之声不绝，众番僧、众武士手中兵刃纷纷落地，正是教主张无忌到了。"""
res = fool.analysis(text)
# print(res[0]r)
person = []
for i in res[1][0]:
    if i[2] == 'person':
        person.append(i[3])

person = set(person)
for i in person:
    print(i)
